#include <stdio.h>
int main()
{
	int a[101],i=0,b[201]={0},j,t,max1,max2;
	printf("请输入-100到100之间的数字：（个数小于100个）\n");
	for(i=0;i<100;i++)//实现数字的输入！ 
	{
		A:;
		scanf("%d",&a[i]);
		if(a[i]>100||a[i]<-100)
		{
		printf("请重新输入：\n");
		goto A;
		}
		if(a[i]==-1)
		break;
	}
	/*for(i=0;a[i]!=-1;i++)
	{ 
	printf("%d\n",a[i]);
	}*/
//	for(j=0;j<201;j++)
//		b[j]=0;
	for(i=0;a[i]!=-1;i++)//统计个数 
	{
		for(j=0;j<201;j++)
		{
		if(a[i]==(j-100))
			b[j]++;
		}
	}
//	for(j=0;j<201;j++)
//	if(b[j]!=0)
//	printf("%d的个数为%d\n",j-100,b[j]);
	for(i=0;i<201;i++)
	{
		if(b[i]!=0)
		{ 
		max1=b[i];max2=i-100;
		for(j=0;j<201;j++)//别家b[j]!=0,如果第一个为0的话，这个循环进不去！ 
		{
		//	printf("lj");
			if(b[i]<b[j])
			{
			max1=b[j];
			max2=j-100;//别忘了-100！ 
			}
		}
		for(j=0;j<201;j++)
			if(j-100==max2)//这块用max2去找是为了让有个数相同的max1都变成0；并且都可以输出！ 
				b[j]=0;
		if(b[i]==max1)//这块确保如果第一个是最大的，那么让它变成0！上面的j都默认i不是最大的那一个！ 
			b[i]=0;		
		if(max1!=0) 
		printf("%d的个数有%d个！\n",max2,max1);
		i=0;//这块如果不命令i=0，那么如果输入的第一个数字重复的次数是最小的话，会被忽略掉
		//在这之后程序的运行就无法显示这个最小的，所以有必要让这个回到一开始！ 
		}
	}
	/*for(i=0;b[i]!=0&&i<201;i++)
	printf("%d的个数有%d个\n",i,b[i]);*/
	return 0;
}
